cs312/hw5/hw5.org
#+title: Hw5
#+author: Jackson Mowry jmowry4
#+date: Tue Sep 24 09:59:47 2024

* 1
Product a context-free grammer (CFG) for each of the folloing languages, assuming \Sigma{} = {0,1}:
a. {w | w starts and ends with the same symbol}
   - S \rightarrow{} 0S0 | 1S1 | 0A0 | 1A1
   - A \rightarrow{} 0A | 1A | \epsilon{}
b. {w | the length is odd}
   - S \rightarrow{} 0A | 1A
   - A \rightarrow{} 0S | 1S | \epsilon{}
c. {ww^{R} | i.e., a word followed by that word reverse}
   - S \rightarrow{} 1S1 | 0S0 | \epsilon
* 2
Let G = ({S,A,B,C,D,E,Z}, (0,1), R, S), where R = {S \rightarrow{} E | Z; E \rightarrow{} A | C; A \rightarrow{} 01B | 0A | c; B \rightarrow{} 1B | 10A; C \rightarrow{} 10D | 1C | \epsilon; D \rightarrow{} 01C | 0D; Z \rightarrow{} 0Z1 | \epsilon}.
a. Describe the language L (in English) that is generated by the CFG G.
   - The language either produces strings with equal numbers of 0's and 1's, with 1's always following 0's (or an empty string), or it produces strings starting with either 0, 1, or the empty string . If the string is non-empty and starts with a 0 it will not contain the substring 010. If the string is non-empty and starts with a 1 it will not contain the substring 101.
b. Assume L is a regular language and let p be the pumping length of A. Choose /s/ to be = 0^{p}1^{p} \in l. Clearly |0^{p}1^{p}| \gt p. According to the pumping lemma, /s/ can be partitioned into /s/ = xyz \in L suchthat for all i \geq 0, we have the following xy^{i}z \in L. By condition 3 of the pumping lemma, we must also have |xy| \leq p. Therefore y must consist only of 0s and subsequently xyyz = xy^{2}z \notin L _since the first part of_ the string s would now have a greater number of 0's than 1's meaning the string s \notin L. Hence, /s/ cannot be pumped and that is a violation of our assuption that L is regular. By this contradiction we can conclude that the language L is not regular.#
