cs312/hw5/hw5.tex
% Created 2024-09-29 Sun 18:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jackson Mowry jmowry4}
\date{Tue Sep 24 09:59:47 2024}
\title{Hw5}
\hypersetup{
 pdfauthor={Jackson Mowry jmowry4},
 pdftitle={Hw5},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{1}
\label{sec:org38cb567}
Product a context-free grammer (CFG) for each of the folloing languages, assuming \(\Sigma\) = \{0,1\}:
\begin{enumerate}
\item \{w | w starts and ends with the same symbol\}
\begin{itemize}
\item S \(\rightarrow\) 0S0 | 1S1 | 0A0 | 1A1
\item A \(\rightarrow\) 0A | 1A | \(\epsilon\)
\end{itemize}
\item \{w | the length is odd\}
\begin{itemize}
\item S \(\rightarrow\) 0A | 1A
\item A \(\rightarrow\) 0S | 1S | \(\epsilon\)
\end{itemize}
\item \{ww\textsuperscript{R} | i.e., a word followed by that word reverse\}
\begin{itemize}
\item S \(\rightarrow\) 1S1 | 0S0 | \(\epsilon\)
\end{itemize}
\end{enumerate}
\section{2}
\label{sec:org3c0a438}
Let G = (\{S,A,B,C,D,E,Z\}, (0,1), R, S), where R = \{S \(\rightarrow\) E | Z; E \(\rightarrow\) A | C; A \(\rightarrow\) 01B | 0A | c; B \(\rightarrow\) 1B | 10A; C \(\rightarrow\) 10D | 1C | \(\epsilon\); D \(\rightarrow\) 01C | 0D; Z \(\rightarrow\) 0Z1 | \(\epsilon\)\}.
\begin{enumerate}
\item Describe the language L (in English) that is generated by the CFG G.
\begin{itemize}
\item The language either produces strings with equal numbers of 0's and 1's, with 1's always following 0's (or an empty string), or it produces strings starting with either 0, 1, or the empty string . If the string is non-empty and starts with a 0 it will not contain the substring 010. If the string is non-empty and starts with a 1 it will not contain the substring 101.
\end{itemize}
\item Assume L is a regular language and let p be the pumping length of A. Choose \emph{s} to be = 0\textsuperscript{p}1\textsuperscript{p} \(\in\) l. Clearly |0\textsuperscript{p}1\textsuperscript{p}| \textgreater{} p. According to the pumping lemma, \emph{s} can be partitioned into \emph{s} = xyz \(\in\) L suchthat for all i \(\ge\) 0, we have the following xy\textsuperscript{i}z \(\in\) L. By condition 3 of the pumping lemma, we must also have |xy| \(\le\) p. Therefore y must consist only of 0s and subsequently xyyz = xy\textsuperscript{2}z \(\notin\) L \uline{since the first part of} the string s would now have a greater number of 0's than 1's meaning the string s \(\notin\) L. Hence, \emph{s} cannot be pumped and that is a violation of our assuption that L is regular. By this contradiction we can conclude that the language L is not regular.\#
\end{enumerate}
\end{document}
